In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
import warnings 
warnings.filterwarnings("ignore")
pd.pandas.set_option("display.max_columns",None)

#Create Dataframe
df=pd.read_csv("EasyVisa.csv")
print(df.shape)

(25480, 12)

In [5]:
# Data Cleaning
# Handling missing values
# 1.Handling missing values
# 2.Handling Duplicates
# 3.Check Data Types
# 4.Understand the Dataset

In [10]:
# Check Null Values
# df.isnull()
# Features with nan values

features_with_nan=[features for features in df.columns if df[features].isnull().sum()>1]
for feature in features_with_nan:
    print(feature,np.round(df[feature].isnull().mean()*100,5),' %missing values')

In [11]:
#Check for Duplicate values
df.duplicated().sum()

0

In [12]:
#Remove case id from the dataset as it cannot be used for modelling
df.drop('case_id',inplace = True, axis=1)

In [13]:
# Feature Engineering

In [15]:
# Feature Extraction

In [16]:
df.head()

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [ ]:
#Importing data class from datetime module

from datetime import 
class MODEL_NAMEDetailView(DetailView):
    model = MODEL_NAME
    template_name = "TEMPLATE_NAME"